#+title: graph.el

** Minimal Example

#+begin_src emacs-lisp :results raw
(add-to-list 'load-path default-directory)
(require 'graph)

(let ((g (graph-create)))
  (graph-add-node g
                  :id 'root
                  :row 0
                  :col 2
                  :data '(:label "root"))
  (graph-add-node g
                  :id 'left
                  :row 3
                  :col 0
                  :data '(:label "left"))
  (graph-add-node g
                  :id 'right
                  :row 3
                  :col 4
                  :data '(:label "right"))
  (graph-add-edge g
                  :from 'root
                  :to 'left
                  :points '((0 . 2) (1 . 2) (2 . 1) (3 . 0)))
  (graph-add-edge g
                  :from 'root
                  :to 'right
                  :points '((0 . 2) (1 . 2) (2 . 3) (3 . 4)))
  (with-temp-buffer
    (graph-view-mode)
    (graph-view-set-graph g)
    (princ (concat "#+begin_example\n"
                   (buffer-string)
                   "#+end_example\n"))))
#+end_src

#+RESULTS:
#+begin_example
  o  
  |  
 / \ 
o   o
#+end_example

That renders directly into the Org results block. If you want the same graph in
its own interactive buffer, replace the final ~with-temp-buffer~ form inside
the ~let~ block with:

#+begin_src emacs-lisp
(graph-open g "*Example Graph*")
#+end_src

* Building Git-Like Layouts

Nothing in =graph.el= is Git-specific. A Git history view is just a graph where:

- each commit is a node
- rows correspond to commit order
- columns correspond to active lanes
- parent relationships become edges

The important idea is that layout happens before rendering. For example:

#+begin_src emacs-lisp :results raw
(add-to-list 'load-path default-directory)
(require 'graph)

(let ((g (graph-create)))
  ;; Newest commit in lane 0.
  (graph-add-node g :id 'c3 :row 0 :col 0)
  ;; Side branch commit in lane 1.
  (graph-add-node g :id 'c2 :row 2 :col 1)
  ;; Mainline parent back in lane 0.
  (graph-add-node g :id 'c1 :row 4 :col 0)

  ;; Merge-looking edge.
  (graph-add-edge g
                  :from 'c3
                  :to 'c1
                  :points '((0 . 0) (1 . 0) (2 . 0) (3 . 0) (4 . 0)))
  ;; Side branch flowing back.
  (graph-add-edge g
                  :from 'c3
                  :to 'c2
                  :points '((0 . 0) (1 . 0) (2 . 1)))
  (with-temp-buffer
    (graph-view-mode)
    (graph-view-set-graph g)
    (princ (concat "#+begin_example\n"
                   (buffer-string)
                   "#+end_example\n"))))
#+end_src

#+RESULTS:
#+begin_example
o 
| 
|o
| 
o 
#+end_example

